---
kind: property
id: P:Autodesk.Revit.DB.RuledFace.Curve(System.Int32)
zh: 曲线
source: html/e1291b2c-73b2-09d0-09bd-082fe27fd27c.htm
---
# Autodesk.Revit.DB.RuledFace.Curve Property

**中文**: 曲线

Profile curves of the surface.

## Syntax (C#)
```csharp
public Curve this[
	int index
] { get; }
```

## Parameters
- **index** (`System.Int32`)